CRIS67/CoupeDeFrance2019/Programmation/dsPIC/CoupeDeFrance2018.X/main.c
                    newPosReceived = 0;
                    
                    double angularVelocity = 0;
                    double maxAngularVelocity = funAngularSpeed;
                    double AngularAcceleration = funAngularAcc;
                    double angle = 0;
                    theta0 = theta;
                    double prevAngularVelocity = 0;
                    double phi = 20*PI;
                    double sign = 1;
                    if(sens == 0){
                        sign = -1;
                        sens = 1;
                    }
                    else{
                        sign = 1;
                        sens = 0;
                    }
                    finalPoint = 0; 
                            while(angularVelocity < maxAngularVelocity && angle < phi/2){
                                angularVelocity += AngularAcceleration * TE;
                                angle += TE * (prevAngularVelocity + angularVelocity) / 2;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                            double angle1 = angle;
                            while(angle < phi - angle1){
                                angle += TE * angularVelocity;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                            AngularAcceleration = -AngularAcceleration;
                            while(angularVelocity > 0 && angle < phi){
                                angularVelocity += AngularAcceleration * TE;
                                angle += TE * (prevAngularVelocity + angularVelocity) / 2;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                    finalPoint = 1;
                    
                }
                else{
                    statePathGeneration = 42;
                    delay_ms(100);
                    newPosReceived = 0;
                    if(newPosBackReceived)
                    {
                        newPosBackReceived = 0;
                        //printRpi(("DEBUG goBack main 1\n"));
                        goBack(receivedX,receivedY,2000,200);
                        //printRpi(("DEBUG goBack main 2\n"));
                    }
                    else{
                        //go(receivedX,receivedY,2000,200);
                        //go(receivedX,receivedY,1000,100);
                        modif_straightPath(receivedX,receivedY,0,funSpeed,funAcc);
                        //modif_straightPath(receivedX,receivedY,0,1000,100);
                    }
                }
            }
            if(newAngleReceived){
                newAngleReceived = 0;
                turn(receivedTheta);
            }
            /*if(statePathGeneration){
                plot(1,(uint32)(int32)(((thetac*3600)/(2*PI))));
                plot(2,(uint32)(int32)(((angularVelocity*3600)/(2*PI))));
                plot(3,(uint32)(int32)(((theta*3600)/(2*PI))));
            }*/
        //}
        
    }

    while(1){
        if(stop){
            //IEC0bits.T1IE = 0;  //stop asserv
            sendToMotor(0,0);   //stop motors
            while(stop){        //wait for start signal
            }
            //IEC0bits.T1IE = 1;  //restart asserv
        }
        switch(state){
            case 0: //init
                IEC0bits.T1IE = 0;
                x = 0;
                y = 0;
                theta = 0;
                xc = 0;
                yc = 0;
                thetac = 0;
                xf = 0;
                yf = 0;
                tf = 0;
                POS1CNTL = 0x8000;
                POS2CNTL = 0x8000;
                IEC0bits.T1IE = 1;
                delay_ms(1000);
                state++;
                break;
            case 1 :
                if(newPosReceived){
                    newPosReceived = 0;
                    if(newPosBackReceived)
                    {
                        newPosBackReceived = 0;
                        //printRpi(("DEBUG goBack main 1\n"));
                        goBack(receivedX,receivedY,2000,200);
                        //printRpi(("DEBUG goBack main 2\n"));
                    }
                    else
                        //go(receivedX,receivedY,2000,200);
                        modif_straightPath(receivedX,receivedY,0,1000,1000);
                }
                if(newAngleReceived){
                    newAngleReceived = 0;
                    turn(receivedTheta);
                }
                delay_ms(100);
                break;
            default:
                sendLog("ERROR UNDEFINED STATE");
                break;       
        }
       
    }
    return 0;
}

void testAccMax(){
    double commandeL = 12;
    double prevCommandeL = 0;
    double delta = 0.1;
    double newCL;
    while(1){
        if(commandeL - prevCommandeL > delta)
            newCL = prevCommandeL + delta;
        else if(commandeL - prevCommandeL < -delta)
            newCL = prevCommandeL - delta;
        else
            newCL = commandeL;
        prevCommandeL = newCL;
        sendToMotor(0,newCL);
        delay_ms(30);
    }
}
void reglageDiametre(){
    IEC0bits.T1IE = 0;
    POS1CNTL = 0x8000;
    POS2CNTL = 0x8000;
    double l,r,l2,r2;
    double D1,D2;
    while(1){
        l = (double)(POS1CNTL - 0x8000) * PI * 2 * ENCODER_WHEEL_RADIUS / 4096;
        r = (POS2CNTL - 0x8000) * PI * 2 * ENCODER_WHEEL_RADIUS / 4096;
        l2 = (double)(POS1CNTL - 0x8000) * PI * 2 / 4096;
        r2 = (double)(POS2CNTL - 0x8000) * PI * 2 / 4096;
        D1 = 300/l2;
        D2 = 300/r2;
        
        /*print("l : ");
        print(itoa((int)l));
        print("      r : ");
        print(itoa((int)r));
        print("      D1 : ");
        print(itoa((int)(D1)));
        print("      D1*100 : ");
        print(itoa((int)(D1*100)));
        print("      D2 : ");
        print(itoa((int)(D2)));
        print("      D2*100 : ");
        print(itoa((int)(D2*100)));
       
